{
  "attention_probs_dropout_prob": 0.1,
  "attention_type": "bert",
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "lsh_functions": 7,
  "lsh_hash_function": "simhash",
  "lsh_location": "mlp",
  "lsh_tables": 30,
  "max_position_embeddings": 512,
  "model_type": "lsh",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "rehashing_interval": 1024,
  "sampling_function": "vanilla",
  "sampling_num_target_neurons": 128,
  "tie_embeddings": true,
  "transformers_version": "4.31.0.dev0",
  "type_vocab_size": 1,
  "vocab_size": 30522
}
